{
    "format": "layers-model",
    "generatedBy": "keras v2.15.0",
    "convertedBy": "TensorFlow.js Converter v4.14.0",
    "modelTopology": {
        "keras_version": "2.15.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "model",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                19
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "input"
                        },
                        "name": "input",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layerslayers0Gemm_output_0",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 64,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "layerslayers0Gemm_output_0",
                        "inbound_nodes": [
                            [
                                [
                                    "input",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "layerslayers1Relu_output_0",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "layerslayers1Relu_output_0",
                        "inbound_nodes": [
                            [
                                [
                                    "layerslayers0Gemm_output_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layerslayers2Gemm_output_0",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 64,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "layerslayers2Gemm_output_0",
                        "inbound_nodes": [
                            [
                                [
                                    "layerslayers1Relu_output_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "layerslayers3Relu_output_0",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "layerslayers3Relu_output_0",
                        "inbound_nodes": [
                            [
                                [
                                    "layerslayers2Gemm_output_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "layerslayers4Gemm_output_0",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 64,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "layerslayers4Gemm_output_0",
                        "inbound_nodes": [
                            [
                                [
                                    "layerslayers3Relu_output_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Activation",
                        "config": {
                            "name": "layerslayers5Relu_output_0",
                            "trainable": true,
                            "dtype": "float32",
                            "activation": "relu"
                        },
                        "name": "layerslayers5Relu_output_0",
                        "inbound_nodes": [
                            [
                                [
                                    "layerslayers4Gemm_output_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "output",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 1,
                            "activation": "linear",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "output",
                        "inbound_nodes": [
                            [
                                [
                                    "layerslayers5Relu_output_0",
                                    0,
                                    0,
                                    {}
                                ]
                            ]
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "output",
                        0,
                        0
                    ]
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "layerslayers0Gemm_output_0/kernel",
                    "shape": [
                        19,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layerslayers0Gemm_output_0/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layerslayers2Gemm_output_0/kernel",
                    "shape": [
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layerslayers2Gemm_output_0/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layerslayers4Gemm_output_0/kernel",
                    "shape": [
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "layerslayers4Gemm_output_0/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output/kernel",
                    "shape": [
                        64,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "output/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}