{
  "format": "graph-model",
  "generatedBy": "2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.14.0",
  "signature": {
    "inputs": {
      "input": {
        "name": "input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "1" }, { "size": "19" }] }
      }
    },
    "outputs": {
      "output": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "PartitionedCall/flatten/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "19" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/mul_1",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/mul_3",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/mul_5",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_3",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/mul_7",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "input",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": { "shape": { "dim": [{ "size": "1" }, { "size": "19" }] } }
        }
      },
      {
        "name": "PartitionedCall/flatten/Reshape",
        "op": "Reshape",
        "input": ["input", "PartitionedCall/flatten/Const"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/layers/layers.1/Relu",
        "op": "_FusedMatMul",
        "input": [
          "PartitionedCall/flatten/Reshape",
          "PartitionedCall/transpose",
          "PartitionedCall/mul_1"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "epsilon": { "f": 0.0 },
          "leakyrelu_alpha": { "f": 0.2 },
          "T": { "type": "DT_FLOAT" },
          "transpose_a": { "b": false },
          "num_args": { "i": "1" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/layers/layers.3/Relu",
        "op": "_FusedMatMul",
        "input": [
          "PartitionedCall/onnx_tf_prefix_/layers/layers.1/Relu",
          "PartitionedCall/transpose_1",
          "PartitionedCall/mul_3"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "transpose_a": { "b": false },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "transpose_b": { "b": false },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/layers/layers.5/Relu",
        "op": "_FusedMatMul",
        "input": [
          "PartitionedCall/onnx_tf_prefix_/layers/layers.3/Relu",
          "PartitionedCall/transpose_2",
          "PartitionedCall/mul_5"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "leakyrelu_alpha": { "f": 0.2 },
          "num_args": { "i": "1" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/add_3",
        "op": "_FusedMatMul",
        "input": [
          "PartitionedCall/onnx_tf_prefix_/layers/layers.5/Relu",
          "PartitionedCall/transpose_3",
          "PartitionedCall/mul_7"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "transpose_b": { "b": false },
          "transpose_a": { "b": false },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["PartitionedCall/add_3"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1645 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "PartitionedCall/flatten/Const",
          "shape": [2],
          "dtype": "int32"
        },
        {
          "name": "PartitionedCall/transpose",
          "shape": [19, 64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.42161629620720353,
            "scale": 0.0031940628500545724,
            "original_dtype": "float32"
          }
        },
        {
          "name": "PartitionedCall/mul_1",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.23246545329982157,
            "scale": 0.002132710580732308,
            "original_dtype": "float32"
          }
        },
        {
          "name": "PartitionedCall/transpose_1",
          "shape": [64, 64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.3298742850621541,
            "scale": 0.0025974353154500323,
            "original_dtype": "float32"
          }
        },
        {
          "name": "PartitionedCall/mul_3",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.1387531714112151,
            "scale": 0.0011373210771411073,
            "original_dtype": "float32"
          }
        },
        {
          "name": "PartitionedCall/transpose_2",
          "shape": [64, 64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.2673662003348855,
            "scale": 0.002700668690251369,
            "original_dtype": "float32"
          }
        },
        {
          "name": "PartitionedCall/mul_5",
          "shape": [64],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.12267266427185021,
            "scale": 0.0010138236716681836,
            "original_dtype": "float32"
          }
        },
        {
          "name": "PartitionedCall/transpose_3",
          "shape": [64, 1],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": -0.18206403010031755,
            "scale": 0.0018390306070739148,
            "original_dtype": "float32"
          }
        },
        {
          "name": "PartitionedCall/mul_7",
          "shape": [1],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint8",
            "min": 0.12623915076255798,
            "scale": 1.0,
            "original_dtype": "float32"
          }
        }
      ]
    }
  ]
}
