{
    "format": "graph-model",
    "generatedBy": "2.15.0",
    "convertedBy": "TensorFlow.js Converter v4.14.0",
    "signature": {
        "inputs": {
            "input": {
                "name": "input:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "1"
                        },
                        {
                            "size": "19"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "output": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "1"
                        },
                        {
                            "size": "1"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "PartitionedCall/flatten/Const",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "19"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/mul_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/mul_3",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_2",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/mul_5",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/transpose_3",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "64"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/mul_7",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/Constant_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "2"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "PartitionedCall/Where_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [
                                    {},
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "PartitionedCall/Cast_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "PartitionedCall/GatherV2_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {
                                "dim": [
                                    {}
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "PartitionedCall/zeros_1",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT64",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "input",
                "op": "Placeholder",
                "attr": {
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "1"
                                },
                                {
                                    "size": "19"
                                }
                            ]
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/SparseToDense_1",
                "op": "SparseToDense",
                "input": [
                    "PartitionedCall/Where_1",
                    "PartitionedCall/Cast_1",
                    "PartitionedCall/GatherV2_1",
                    "PartitionedCall/zeros_1"
                ],
                "attr": {
                    "Tindices": {
                        "type": "DT_INT64"
                    },
                    "T": {
                        "type": "DT_INT64"
                    },
                    "validate_indices": {
                        "b": true
                    }
                }
            },
            {
                "name": "PartitionedCall/flatten/Reshape",
                "op": "Reshape",
                "input": [
                    "input",
                    "PartitionedCall/flatten/Const"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "Tshape": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "PartitionedCall/add_5",
                "op": "AddV2",
                "input": [
                    "PartitionedCall/onnx_tf_prefix_/Constant_1",
                    "PartitionedCall/SparseToDense_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/layers/layers.1/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "PartitionedCall/flatten/Reshape",
                    "PartitionedCall/transpose",
                    "PartitionedCall/mul_1"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/layers/layers.3/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "PartitionedCall/onnx_tf_prefix_/layers/layers.1/Relu",
                    "PartitionedCall/transpose_1",
                    "PartitionedCall/mul_3"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/layers/layers.5/Relu",
                "op": "_FusedMatMul",
                "input": [
                    "PartitionedCall/onnx_tf_prefix_/layers/layers.3/Relu",
                    "PartitionedCall/transpose_2",
                    "PartitionedCall/mul_5"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA==",
                                "UmVsdQ=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/add_4",
                "op": "_FusedMatMul",
                "input": [
                    "PartitionedCall/onnx_tf_prefix_/layers/layers.5/Relu",
                    "PartitionedCall/transpose_3",
                    "PartitionedCall/mul_7"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "PartitionedCall/onnx_tf_prefix_/Reshape_1",
                "op": "Reshape",
                "input": [
                    "PartitionedCall/add_4",
                    "PartitionedCall/add_5"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "Tshape": {
                        "type": "DT_INT64"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "PartitionedCall/onnx_tf_prefix_/Reshape_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 1645
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "PartitionedCall/flatten/Const",
                    "shape": [
                        2
                    ],
                    "dtype": "int32"
                },
                {
                    "name": "PartitionedCall/transpose",
                    "shape": [
                        19,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/mul_1",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/transpose_1",
                    "shape": [
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/mul_3",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/transpose_2",
                    "shape": [
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/mul_5",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/transpose_3",
                    "shape": [
                        64,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/mul_7",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "PartitionedCall/onnx_tf_prefix_/Constant_1",
                    "shape": [
                        2
                    ],
                    "dtype": "int32"
                },
                {
                    "name": "PartitionedCall/Where_1",
                    "shape": [
                        0,
                        1
                    ],
                    "dtype": "int32"
                },
                {
                    "name": "PartitionedCall/Cast_1",
                    "shape": [
                        1
                    ],
                    "dtype": "int32"
                },
                {
                    "name": "PartitionedCall/GatherV2_1",
                    "shape": [
                        0
                    ],
                    "dtype": "int32"
                },
                {
                    "name": "PartitionedCall/zeros_1",
                    "shape": [],
                    "dtype": "int32"
                }
            ]
        }
    ]
}